app/Controllers/Usuarios.php

    public function atualizar() {
        if (!$this->request->isAJAX()) {
            return redirect()->back();
        }

        $retorno['token'] = csrf_hash();

        $post = $this->request->getPost();

        $usuario = $this->buscaUsuarioOu404($post['id']);

        if (empty($post['password'])) {
            unset($post['passowrd']);
            unset($post['passowrd_confirmation']);
        }

        $usuario->fill($post);

//        echo '<pre>';
//        var_dump($usuario->original());
//        echo '<pre>';
//        var_dump($usuario->atributos());
//        exit;

        if ($usuario->hasChanged() == false) {
            $retorno['info'] = 'Não há dados para serem atualizados';
            return $this->response->setJSON($retorno);
        }

        if ($this->usuarioModel->protect(false)->save($usuario)) {
---
UPDATE `usuarios` SET `id` = '1', `atualizado_em` = '2023-10-30 14:47:49', `password_hash` = '$2y$10$u5gYmiOEpq0KSLSMr57xteHXccPAIDKIfpVgYjDcKsFN9gKiudnEm'
WHERE `usuarios`.`id` IN ('1')

    private function buscaUsuarioOu404(int $id = null) {

        if (!$id || !$usuario = $this->usuarioModel->withDeleted(true)->find($id)) {
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = 1